app/controllers/sessions_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'lucas@hotmail.com' AND `users`.`password` = '1234' LIMIT 1
---
	def create
		@user = User.find_by(email: params[:session][:email].downcase, password: params[:session][:password])