app/controllers/tasks_controller.rb

INSERT INTO `tasks` (`title`, `description`, `spentTime`, `id_category`, `id_user`, `created_at`, `updated_at`, `idDayWeek`) VALUES ('TRABALHO DE PROGRAMAÇÃO', 'DESENVOLVER UM SISTEMA DE CONTROLE DO TEMPO.', 16, 1, 1, '2017-04-29 11:29:12', '2017-04-29 11:29:12', 7)
---
    def create
    	@task = Task.new(task_params)
        @task.id_user = session[:user_id]
        @task.idDayWeek = (@task.date.wday + 1)
    	if @task.save

SELECT  `tasks`.* FROM `tasks` WHERE `tasks`.`id` IS NULL LIMIT 1
UPDATE `tasks` SET `description` = 'JOGAR PARTIDAS DE COUNTER-STRIKE PARA SUBIR DE PATENTE PARA AK.', `spentTime` = NULL, `updated_at` = '2017-04-29 12:26:06' WHERE `tasks`.`id` = 21
---
    def update
      @task = Task.find(task_params[:id])
      task_params[:spentTime] = calc_horas(@task.spentTime, task_params[:spentTime].to_i)
      @task.update_attributes(task_params)