app/controllers/users_controller.rb

	def create
		@user = User.new(user_params)

		if @user.save
---
INSERT INTO `users` (`name`, `email`, `job`, `password`, `created_at`, `updated_at`) VALUES ('admin', 'admin@admin.com', 'desenvolvedor', '1234', '2017-05-05 12:24:34', '2017-05-05 12:24:34')